{
  "user_profile": {
    "id": 0,
    "name": "Alin"
  },
  "saved_state": {
    "opened_projects": [
      {
        "id": 1,
        "name": "Lumen Index",
        "stage": "questions",
        "selected": true
      },
      {
        "id": 2,
        "name": "Testing",
        "stage": "questions",
        "selected": false
      },
      {
        "id": 3,
        "name": "Exploratory",
        "stage": "questions",
        "selected": false
      }
    ]
  },
  "projects": [
    {
      "id": 1,
      "name": "Lumen Index",
      "stages": [
        {
          "id": 1,
          "name": "questions",
          "title": "A Basic Territorial Coherence Index in Support for Inter-Communal Co-operation. A Working Hypothesis",
          "abstract": "The aim of this paper is to construct a simple territorial coherence index based on minimal population and geographical data. Essentially, the index works with demographic masses and distances between rural settlements and the nearest urban centre. The reasons for such an exercise are not very hard to find: first, ‘gravitational’ indices lend themselves well enough to grasping the structure of the urban hinterland, thereby making them valuable for the study of peri-urban areas. And second, because they can inform planners about possible market or commuting areas, which, in turn, can help calibrate public service provision.",
          "keywords": [
            "territorial cohesion index",
            "inter-communality",
            "public service provision",
            "peri-urban areas"
          ],
          "questions": [
            "Is there a good general service access?",
            "What are the most poorly serviced areas?"
          ]
        },
        {
          "id": 2,
          "name": "dataset"
        },
        {
          "id": 3,
          "name": "aquisition"
        },
        {
          "id": 4,
          "name": "processing"
        },
        {
          "id": 5,
          "name": "visualization"
        },
        {
          "id": 6,
          "name": "writing",
          "paper": [
            {
              "version": 3,
              "text": "<h1><strong>A Basic Territorial Coherence Index in Support for Inter-Communal Co-operation. A Working Hypothesis</strong></h1><p><br></p><p><strong>Sârbu C. N.</strong><sup><strong>1</strong></sup><strong>, Mitrea A.</strong><sup><strong>2</strong></sup><strong>, Chiș, A. D.</strong><sup><strong>3</strong></sup></p><p><sup><em>1 </em></sup><em>School of Urban Planning, ‘Ion Mincu’ University of Architecture and Urban Planning, Bucharest (ROMANIA)</em></p><p><sup><em>2 </em></sup><em>School of Urban Planning, ‘Ion Mincu’ University of Architecture and Urban Planning, Bucharest (ROMANIA)</em></p><p><sup><em>3</em></sup><em> School of Geography, University of Bucharest, Bucharest (ROMANIA).</em></p><p><em>sarbu52 [at] yahoo.com, andrei.mitrea [at] uauim.ro, alin.d.chis [at] gmail.com</em></p><p><br></p><h3><strong>Abstract</strong></h3><p>This paper presents our preliminary results in constructing a method for outlining possible spatial contours of inter-communal co-operative associations. Over the past few years, we have been actively engaged in studying matters related to inter-communality, for two main reasons: first, because we believe that current interests in inter-communal co-operation areas should be more scientifically informed, and second, because we think that the logic of public service provision has to be rethought in terms of spatial efficiency.</p><p>Hence, we have started work upon a basic territorial coherence index, based on minimal demographic and geographical data. Thus, the index works with populations and distances between rural settlements and the nearest urban centre. In constructing the index, we employ a ‘gravitational’ perspective, focusing on the coherence of rural areas located around an urban centre. We have plotted our current results on two different maps, which are meant to serve as a platform for future debates.</p><p>Keywords: Territorial Coherence Index, Inter-Communality, Public Service Provision, Peri-Urban Areas.</p><p><br></p><h2>1 Introduction</h2><p>We have written this paper with the explicit intention of stimulating further studies dedicated to urban and rural inter-communal co-operation areas. Within the latest generation of spatial plans, we have witnessed a recurring interest in inter-communal co-operation areas, especially in relation to peri-urban areas. Unfortunately, research dedicated to urban-rural interactions is still very hard to find, both nationally and internationally [1].</p><p>Against this background, the aim of this paper is to construct a simple territorial coherence index based on minimal population and geographical data. Essentially, the index works with demographic masses and distances between rural settlements and the nearest urban centre. The reasons for such an exercise are not very hard to find: first, ‘gravitational’ indices lend themselves well enough to grasping the structure of the urban hinterland, thereby making them valuable for the study of peri-urban areas. And second, because they can inform planners about possible market or commuting areas, which, in turn, can help calibrate public service provision.</p><p>This type of research is highly relevant within the Romanian context, where the share of rural population amounts to about 46% of the total population [2], and where on-going structural changes imply a probable future concentration in and around urban centres [3], [4], [5].</p><p><br></p><h2>1.1 Hypotheses</h2><p>Such concentrations are suited to provide the argument for rethinking public service provision in terms of spatial efficiency, thereby providing basic services to as many inhabitants as possible. In other words, the efficiency of public services increases with an increment in demand, thus making public investment more profitable [6]. This is our first working hypothesis.</p><p>Our second hypothesis states that a concentration of public services in towns corresponds to current development needs within rural areas [7], [8], as villages cannot afford to provide them anymore [9].</p><p><br></p><h2>1.2 The Basic Territorial Coherence Index</h2><p>From the beginning, we strove for a simple, intuitive index. Hence, we have confined ourselves to using only populations and the distances between municipalities.</p><p>Against this background, we were able to conflate the two earlier hypotheses into the following proposition: The interaction between two municipalities varies proportionally with some function of the population size, i.e. the populations living within the two municipalities under scrutiny, and varies inversely proportional with some function of the distance between them [10]. For all practical purposes, this latter function can be regarded as a sort of friction against movement.</p><p>Stated in mathematical terms, such a relationship takes the following general form [10]:</p><p>(1) I<sub>ij</sub> = <em>f</em>(P<sub>i</sub>, P<sub>j</sub>)/<em>f</em>(d<sub>ij</sub>)</p><p>where:</p><p>I<sub>ij</sub> denotes the ‘interaction’ between two areas or, in our case, municipalities;</p><p>P<sub>i</sub> and P<sub>j</sub> are the populations of the two municipalities, <em>i</em> and <em>j</em>;</p><p>d<sub>ij</sub> is the distance between the aforementioned municipalities.</p><p>Theoretically, this interaction can be viewed both in terms of ‘forces’ and in terms of ‘energies’. It is this propensity for multiple interpretations that gave birth to a wide array of ‘gravity’ and ‘potential’ concepts. Thus, there is a long history of variations upon this theme, spanning more than a century of human geography, which has been aptly summarised by Carrothers [10] and by Lukermann and Porter [11]. Both articles appeared in the late 1950s and early 1960s, at a time when gravitational and potential models were in high fashion with the Regional Science Association.</p><p>However, most authors favour a particular form of ‘gravitational’ approach, which we can write as [12], [13]:</p><p>(2) I<sub>ij</sub> = G*[(P<sub>i</sub>*P<sub>j</sub>)/d<sub>ij</sub><sup>b</sup>]</p><p>where:</p><p>I<sub>ij</sub>, P<sub>i</sub>, P<sub>j</sub> and d<sub>ij</sub> have the meanings ascribed above and</p><p>b is the exponent of the said distance, which is usually taken to be b = 2;</p><p>G is a constant, meant to give the exact form of the equation.</p><p>It is easy to see that the above expression is essentially Newton’s law of universal gravitation, expressed in its modern form:</p><p>(3) F = G*[(m<sub>1</sub>*m<sub>2</sub>)/r<sup>2</sup>]</p><p>Here, masses replace populations, and the force between them is indirectly proportionate to the squared distance (r<sup>2</sup>) between them.</p><p>However, for the purpose of this paper, we have opted for a different formula. Thus, we have defined our basic territorial coherence index as:</p><p>(4) I<sub>TC</sub> = (P<sub>i</sub> + P<sub>j</sub>)/d<sub>ij</sub></p><p>where:</p><p>P<sub>i</sub> and P<sub>j</sub> are the populations of two municipalities, <em>i</em> and <em>j</em> and</p><p>d<sub>ij</sub> is the distance between them.</p><p>One can immediately observe that this index is formally at variance with the tradition sketched above. For one, the index sums populations, instead of multiplying them. Furthermore, it discards the exponent of the distance function, thereby using a linear function for its denominator.</p><p>Interestingly enough, these liberties do not negate the original hypotheses that support the plethora of ‘gravity’ and ‘potential’ models produced since the late 1920s [10]. Specifically, the following four hypotheses still hold:</p><p>(H1) In order to produce interaction, individuals must be able to communicate with one another. Viewed from a perspective of public service provision, especially in the case of education and health provision, communication generally means being in a face-to-face contact;</p><p>(H2) There is generally no difference in the influence exerted by different individuals, i.e. all individuals can be treated as equals;</p><p>(H3) The probable frequency of interaction generated by an individual at a given location is inversely proportional to the difficulty of reaching that particular destination;</p><p>(H4) The friction against movement is proportional to the intervening physical distance between any individual and his or her preferred destination.</p><p>We will return to this matter in the following section.</p><p><br></p><h2>2 Methodology</h2><p>In the end, this exercise proved to be our first successful attempt at analysing the entire Romanian settlement structure from a morphological perspective. Mundane at first sight, it proved to be no mean feat, by any means. Even when focusing on just two variables, i.e. populations and distances between municipalities, we required extensive data processing. To illustrate this point, let us remember that the total number of Romanian municipalities, both urban and rural, rises to about 13,750 units. If one were to calculate the distance between one municipality and any other municipality, the total number of calculations would increase instantly to about 94.5 million. Hence, automatic data processing became indispensable.</p><p><br></p><h2><em>2.1 Research Strategy</em></h2><p>The initial plan was simple and straightforward: to construct an intuitive basic index, employing only demographic masses and distances between municipalities. If successful, we would later use this index for delineating possible inter-communal co-operation areas, as a future expansion of this particular research project. However, for the purposes of this paper, we only intended to test this index at the national level.</p><p>Nonetheless, this intuitive approach proved rather daunting. First, because there is a long tradition in geography of constructing density, concentration, dispersion and centrality indices, which we had to take into account. And second, because processing such large amounts of data is never easy, in technical terms, as it requires repeated consistency checks. Therefore, we still believe that future technical refinements are possible and, indeed welcome.</p><p>However, deciding upon the exact structure of an index is difficult, even if we restrict ourselves to the logic pervading the ‘gravity’ and ‘potential’ models [10], [11]. This is not so much because of the dual ‘force’ or ‘energy’ interpretation, but because of the two dimensions involved.</p><p>As stated in equation 1, ‘interaction’ models have population functions as their numerator, and distance functions as their denominator. It stands to reason that these functions need not be linear in nature. Hence, a century old tradition has produced a variety of weights and exponents, which vary greatly in their complexity. However, greater complexity means less transparency. This was the first reason for us to depart from this tradition.</p><p>But there was a second, deeper reason, which finally convinced us to do so. Close scrutiny revealed that all indices produced over the past hundred years have been postulated by their authors. We could find no clear theoretical construction supporting them, except for the loose analogy with physics.</p><p>Therefore, we focused our attention on more practical matters. Working from a perspective centred on public service provision, replacing the product of the populations with their sum seemed more reasonable for estimating possible markets. In addition, we chose not to tamper with the distance function, as we still do not know whether its impact is uniform or not. We have contemplated Carrother’s argument [10], which states that the distance should be raised to an exponent, which is inversely proportional to the distance itself, because “an extra unit of distance added to a long movement is of less importance than an extra unit added to a short movement”. However, by not allowing for a variable related to functional specialisation, i.e. the precise nature of the public service under study, we could not make any informed decision upon whether and how to modify the distance factor.<a href=\"#sdfootnote1sym\" target=\"_blank\"><sup>1</sup></a></p><p><br></p><h2><em>2.2 Data Quality and Collection</em></h2><p>After solving the conceptual issues outlined above, the theoretical construction of the index proved less cumbersome. However, when we moved on to testing the index, matters became complicated.</p><p>We needed two types of information: first, a viable map, containing as many municipalities as possible, and the distances between them, measured on the road. And second, we had to attach populations to as many municipalities as we could.</p><p>The map presented us with the first serious challenge, namely, that there is no official map of Romania, which would contain both municipalities and the road network, and, most importantly, which would be free to use for research purposes. Hence, we have decided upon using the results of the Open Street Maps (OSM) Project for Romania.<a href=\"#sdfootnote2sym\" target=\"_blank\"><sup>2</sup></a> This data contains the road network, with its associated maximum speed limits, as well as the settlement structure, containing the names, geographical co-ordinates<a href=\"#sdfootnote3sym\" target=\"_blank\"><sup>3</sup></a> and codes<a href=\"#sdfootnote4sym\" target=\"_blank\"><sup>4</sup></a> for each municipality. In order to check for consistency, we used an additional dataset, this time provided by the Romanian Government, which contains names and SIRUTA<a href=\"#sdfootnote5sym\" target=\"_blank\"><sup>5</sup></a> codes for the entire settlement network.<a href=\"#sdfootnote6sym\" target=\"_blank\"><sup>6</sup></a> Comparison of the two datasets revealed complete congruence. There are some inconsistencies within the road network, both in terms of geometry and in terms of the maximum speed limits, but we have witnessed consistent and continuous efforts dedicated to improving the quality of the OSM Project.</p><p>Demographic data was easier to get hold of, especially due to the fact that the Romanian National Institute of Statistics (NIS) started granting free access to its on-line database in mid April 2014.<a href=\"#sdfootnote7sym\" target=\"_blank\"><sup>7</sup></a> Working on previous research projects, we have unearthed some inconsistencies within the population datasets, but we have decided to use the available datasets as they come, because we were mainly interested in providing a proof of concept for our proposed index.</p><p><br></p><h2><em>2.3 Data Processing</em></h2><p>There are two different aspects related to matters of data processing: first, there is the problem of constructing a functional database from the imported datasets. And second, there is the issue of graphical representation of the index.</p><p>Concerning the first point, we have opted for the PostgreSQL object-relational database system and the PostGIS spatial database extender.<a href=\"#sdfootnote8sym\" target=\"_blank\"><sup>8</sup></a> Both are open source and free. We made good use of the pgAdmin tool<a href=\"#sdfootnote9sym\" target=\"_blank\"><sup>9</sup></a> in sorting and archiving the data.</p><p>However, we needed more tools. This is because we have taken the distance between two municipalities to mean the shortest path, on the road, between them. Hence, we needed a routing application to calculate these paths. Following from our commitment to using free open source software, we have decided to use the Open Source Routing Machine (OSRM) server.<a href=\"#sdfootnote10sym\" target=\"_blank\"><sup>10</sup></a> The OSRM project is fully integrated with the OSM Project.</p><p>Connecting all these different tools, in order to perform queries on the server programme and, subsequently, to load the results onto the database, required some glue code. The Julia Programming Language turned out to be our instrument of choice, even if it is a relatively young programming language.<a href=\"#sdfootnote11sym\" target=\"_blank\"><sup>11</sup></a> The main reason for this is that Julia has a syntax that is familiar to users who have been working within other technical computing environments. In addition, it allows for using C, Python or R code and libraries.</p><p>That much for raw data processing. Nonetheless, in order to actually produce the maps presented in this paper, we have employed the QGIS software, currently in its 2.8<sup>th</sup> version. We have found its image processing capabilities to be quite acceptable, thereby eliminating the need for any additional image processing software. The end result conforms to the Romanian Stereo 70 projection.</p><p><br></p><h2>3 Results</h2><p>Our results consist of three maps: the first map shows the accessibility of towns and cities in minutes (Fig. 1). A second map depicts our basic index, i.e. equation (4), using five natural breaks (Fig. 2).<a href=\"#sdfootnote12sym\" target=\"_blank\"><sup>12</sup></a> The third and final map depicts the same index, this time using five quantiles (Fig. 3). The reason for displaying two maps with the index, instead of just one, is statistical in nature. We are still searching for the optimal method of displaying the results. However, the investigations we have conducted until now point to these two options, i.e. natural breaks and quantiles, as exhibiting the highest potential for an accurate graphical representation for the index.</p><p>An additional explanation is due here: The I<sub>TC</sub> index yields 13,123 valid values, which range between 33 and 239,042, with the vast majority grouped around the smaller values. If we were to represent these values directly on a map, we would get a pretty much useless image, as we would not be able distinguish the borders separating the more favoured areas from the less favoured ones. Hence, we needed a method to reduce the differences between groups of values, without losing the overall meaning of the index. We therefore applied a logarithmic function (log<sub>10</sub>) on all our values.</p><p>Upon closer inspection, the first map displays a series of pockets with poor accessibility (<em>cf.</em> Fig. 1). Some of them are explained by the geographical layout of the Carpathians, but some seem to be insensitive to it. It is this last category which interests us.</p><p>Thus, we have a major Transylvanian pocket, of about a hundred kilometres in diameter, which stretches from the city of Cluj, on its western side, to the town of Reghin, on its eastern side. Its northern limit lies in Bistrița, while its southern boundary reaches the town of Târnăveni.</p><p>This Transylvanian pocket has three counterparts, one in Oltenia and two in Moldavia. The Oltenian pocket is somewhat triangular in shape, with its three tips in Craiova and in the towns of Târgu Jiu and Drăgășani, respectively. The northern Moldavian pocket is just north of Iași, and stretches all the way up to the town of Botoșani. At about fifty kilometres south, we encounter the central Moldavian pocket, perched between Roman, Bacău, Adjud, Bârlad and Vaslui. It seems to be just as large as its Transylvanian equivalent.</p><p>And last but not least, the region of Dobruja is also marred by deep pockets of inaccessibility, as a direct result of the Danubian course.</p><p>All in all, we have six major areas of poor accessibility, which are complemented by a host of smaller zones, mainly due to the valleys crisscrossing the Carpahians. It is thus plain to see that the urban network is spread unevenly across the territory. Therefore, rural areas are likely to suffer from poor public service provision. And they are likely to be even more affected by the current inability of towns and cities to provide for their hinterlands.</p><p>Against this background, the case of Bucharest and its hinterland deserves an explanation. Careful observation of Figs. 1 and 2 reveals that it is indeed a special case. The index is low, which means that there is a relatively small potential market for public service provision. This apparently strange result is explained by the fact that Bucharest is surrounded by an array of new towns, which make the index somewhat irrelevant. This is because the index was intended to display the accessibility of urban centres, measured from the rural hinterlands surrounding them. The case of Bucharest therefore requires special attention and a dedicated study.</p><p>Returning to our argument, let us compare the base map to the other two. We now stand before a somewhat different picture. The effect of the polarising centres blurs most of the pockets described above. What still remains is the effect of the Carpathian ranges and that of the Danube.</p><p><br></p><h2><em>3.1 Limitations</em></h2><p>At first sight, such a result seems encouraging. However, the question arises whether these maps are relevant, and, if so, to what degree. A clear-cut answer is difficult to give at present. Essentially, what we have arrived at are some possible polarisation areas. These areas can also be viewed as conceivable markets for an optimised public service provision. From this perspective, we believe that these maps are promising, albeit with necessary future refinements.</p><p>Nonetheless, one question still remains: what is the real breadth of these areas? Judging by their aspect, their radii fall within the fifty to seventy kilometres interval. This is, by any means, a somewhat large figure, as it corresponds roughly to the worst possible distance in time to the nearest urban centre (<em>cf. </em>Fig. 1). Therefore, these hypothetical markets seem to be exaggerated in size.</p><p>Furthermore, they do not correspond to the findings present within the dedicated literature. More precisely, Leeuwen [1], in accordance with much of the current research, takes the direct hinterland of small and medium towns to reach the seven-kilometre radius, while the extended hinterland reaches the sixteen-kilometre limit. It is thus plain to see that our areas, or possible markets, need shrinking.</p><p>Nevertheless, how to best tackle this matter is still an open question. At present, we believe there are only two feasible options: first, to add another variable to the equation. This addition would obviously complicate the equation, thus making it less intuitive. The second option would be to add a cut-off function, which would invalidate the effects of distance after a specific point. Intuitively, this latter approach seems sound, but the mathematical construction behind it might be daunting.</p><p><br></p><h2>4 Conclusions</h2><p>To sum up, we think that this entire exercise has proved to be valuable. First, we have managed to produce working maps using free open source data and tools. This is, in itself, a remarkable achievement, at a time when it is still difficult to obtain consistent and accurate official data [14]. And second, because this modelling exercise, incipient as it may seem, has made us more cautious in accepting policy recommendations based on obscure models [15].</p><p>In short, these are the lessons we have learned: even though the resulting areas seem to be exaggerated at this moment, we still believe that the two variables we have employed, i.e. populations and distances, should take centre stage in any basic territorial index. Nonetheless, populations can be detailed into different age groups, according to one’s particular focus. In our case, it would be interesting to model the possible markets for the three main age groups, with a clear view on specialised service provision. However, until we circumvent the limitations described above, the resulting images might not conform to reality.</p><p>It should be kept in mind though, that such an index is of little use if not complemented by other descriptive indicators. However, the exact proportion of modelling and description still eludes us, but we feel it has to be decided upon within each new research project.</p><p>In addition, there is a list of open questions that require further study:</p><p><br></p><ol><li>Does the proposed index take the large existing differences in populations sufficiently well into consideration? This is an important question, as the differences in populations between towns and cities are sometimes quite extreme;</li><li>What would be the best way to include a topographic energy into the equation, which would, in turn, accurately describe the great diversity in terrain across Romania?</li><li>What are the limits of transferring physical formulae into spatial sciences?</li></ol><p>This last question is particularly far reaching in its consequences, as it touches upon the very foundations of space, force and mass [16], [17], [18], and their social implications [19], [20]. For the time being, we have confined this endeavour to a future research project.</p><p>The same applies to our wish to gradually switch perspectives from a traditional view of the settlement network to a newer, network-based approach [21]. We are fully aware that the science of networks is still in its infancy, in the sense that it is more preoccupied with studying the architecture of networks, rather than the processes developing on it [22], [23]. Nonetheless, we think that it is ripe enough for it to be of good use to spatial science, because we now command an extremely powerful tool for analysing big data.</p><p><br></p><h3><strong>REFERENCES</strong></h3><ol><li>Leeuwen, E. S. van (2010). Urban-Rural Interactions. Towns as Focus Points in Rural Development. Berlin/Heidelberg: Springer (Physica).</li><li>Institutul Național de Statistică (Romanian National Institute of Statistics) (2014). România în cifre, 2014. Breviar statistic [Romania in Numbers, 2014. A Statistical Abstract]. Available at: http://www.insse.ro/cms/files/publicatii/Romania_in_Cifre_2014.pdf [11.05.2015].</li><li>Rotariu, T. (2010). Studii demografice [Studies in Demography]. Iași: Polirom.</li><li>Sandu, D. (2005). România rural-neagricolă azi [Rural and Non-Agricultural Romania]. Sociologie Românească 3(4), pp. 76-108.</li><li>Popa, A.-E. (2010). Sat bogat, sat sărac. Comunitate, identitate, proprietate în rurala românesc [Rich Village, Poor Village. Community, Identity [and] Property within Romanian Rural Areas]. Iași: Institutul European.</li><li>Organisation for Economic Co-operation and Development (OECD), (2010), Strategies to Improve Rural Service Delivery. Available at: http://www.keepeek.com/Digital-Asset-Management/oecd/urban-rural-and-regional-development/strategies-to-improve-rural-service-delivery_9789264083967-en#page122 [26.05.2015].</li><li>Rotariu, T. and Voineagu, V. (eds) (2012). Inerție și schimbare. Dimensiuni sociale ale tranziției în România [Stagnation and Change. Social Dimensions of the Romanian Transition]. Iași: Polirom.</li><li>Sandu, D. (1999). Spațiul social al tranziției [The Social Space of Tradition]. Iași: Polirom.</li><li>Engel, A., Harteisen, U. and Kaschlik, A. (eds.) (2012). Kleine Städte in peripheren Regionen. Detmold: Dorothea Rohn Verlag.</li><li>Carrothers, G. A. P. (1956). An Historical Review of the Gravity and Potential Concepts of Human Interactions. Journal of the American Institute of Planners 22(2), pp. 94-102.</li><li>Lukermann, F. and Porter, P. W. (1960). Gravity and Potential in Economic Geography. Annals of American Geographers 50(4), pp. 493-504.</li><li>Batty, M. (2013). The New Science of Cities. Cambridge (MA): The MIT Press.</li><li>Enache, M. (1977). Modele matematice în sistematizare [Mathematical Models in Urban Planning]. Bucharest: Editura Tehnică.</li><li>Ghețău, V. (2012). Drama noastră demografică. Populația României la recensământul din octombrie 2011 [Our Demographic Tragedy. Romania’s Population at the 2011 Census]. Bucharest: Compania.</li><li>Starbuck, W. H. (2006). The Production of Knowledge. The Challenges of Social Science Research. New York (NY): Oxford University Press.</li><li>Jammer, M. (1993). Concepts of Space. The History of Theories of Space in Physics (3rd ed.). New York (NY): Dover Publications.</li><li>Jammer, M. (1957/1999). Concepts of Force. A Study in the Foundation of Dynamics. Mineola (NY): Dover Publications.</li><li>Jammer, M. (2000). Concepts of Mass in Contemporary Physics and Philosophy. Princeton [NJ]: Princeton University Press.</li><li>Löw, M. (2001). Raumsoziologie. Frankfurt am Main: Suhrkamp.</li><li>Schroer, M. (2006). Räume, Orte, Grenzen. Auf dem Weg zu einer Soziologie des Raums. Frankfurt am Main: Suhrkamp.</li><li>Thompson, G. F. (2003). Between Hierarchies and Markets. The Logic and Limits of Network Forms of Organization. New York (NY): Oxford University Press.</li><li>Newman, M. E. J. (2010). Networks. An Introduction. New York (NY): Oxford University Press.</li><li>Newman, M., Barabási, A.-L. And Watts, D. J. (eds.) (2006). The Structure and Dynamics of Networks. Princeton (NJ): Princeton University Press.</li></ol><p><br></p><p class=\"ql-align-center\"><img src=\"../assets/img/map_icon_01.png\" height=\"643\" width=\"909\"></p><p class=\"ql-align-center\"><em>Fig. 1:</em> <strong>The Accessibility of Romanian Towns and Cities, Measured in Time</strong></p><p class=\"ql-align-center\"><em>Source:</em> The Authors.</p><p class=\"ql-align-center\"><img src=\"../assets/img/map_icon_02.png\" height=\"643\" width=\"909\"></p><p class=\"ql-align-center\"><em>Fig. 2:</em> <strong>The Basic Territorial Coherence Index, Using Five Natural Breaks </strong>(Jenks)</p><p class=\"ql-align-center\"><em>Source:</em> The Authors.</p><p class=\"ql-align-center\"><img src=\"../assets/img/map_icon_03.png\" height=\"643\" width=\"909\"></p><p class=\"ql-align-center\"><em>Fig. 3:</em> <strong>The Basic Territorial Coherence Index, Using Five Quantiles</strong></p><p class=\"ql-align-center\"><em>Source:</em> The Authors.</p><h3><br></h3><h3>NOTES</h3><p><a href=\"#sdfootnote1anc\" target=\"_blank\">1</a> Stated in mathematical terms, our index is analogous to the <em>f</em>(x) = 1/x function. Its graph is a hyperbola, which converges asymptotically towards the value of ‘0’ as ‘x’ increases. This is, in itself, a sufficient argument for the need of an additional cut-off function, as described in section 3.1.</p><p><a href=\"#sdfootnote2anc\" target=\"_blank\">2</a> The data is available for download at: http://download.geofabrik.de/europe/romania.html [25.04.2015].</p><p><a href=\"#sdfootnote3anc\" target=\"_blank\">3</a> The Open Street Map (OSM) Project uses co-ordinates calculated within the World Geodetic System (WGS 84).</p><p><a href=\"#sdfootnote4anc\" target=\"_blank\">4</a> The OSM Project uses the SIRUTA <em>(Sistemul Informatic al Registrului Unităților Teritorial–Administrative)</em> classification employed by the National Institute of Statistics (NIS).</p><p><a href=\"#sdfootnote5anc\" target=\"_blank\">5</a> <em>Sistemul Informatic al Registrului Unităților Teritorial–Administrative</em>.</p><p><a href=\"#sdfootnote6anc\" target=\"_blank\">6</a> This dataset is available for download at: http://data.gov.ro/dataset/siruta [25.04.2015].</p><p><a href=\"#sdfootnote7anc\" target=\"_blank\">7</a> Nonetheless, downloading data from the on-line database is cumbersome, as it relies completely on manual selection. Furthermore, there is still the problem of cleaning and formatting the resulting files. We hope that this inconvenience will be resolved some time in the near future.</p><p><a href=\"#sdfootnote8anc\" target=\"_blank\">8</a> PostGIS adds support for geographic objects. It therefore allows location queries to be run in SQL. More information is available at: http://postgis.net [26.04.2015].</p><p><a href=\"#sdfootnote9anc\" target=\"_blank\">9</a> Technically, this client is called an administration and development platform for the PostgreSQL database system. More information is available at: http://www.pgadmin.org [26.04.2015].</p><p><a href=\"#sdfootnote10anc\" target=\"_blank\">10</a> Information about the Open Source Routing Machine (OSRM) Project is available at: http://project-osrm.org [26.04.2015].</p><p><a href=\"#sdfootnote11anc\" target=\"_blank\">11</a> Julia is described as a “[...] high-level, high-performance dynamic programming language for technical computing”. In addition, it has a rich mathematical function library, which can be easily employed. More information is available at: http://julialang.org [16.04.2015].</p><p><a href=\"#sdfootnote12anc\" target=\"_blank\">12</a> The reason for using five intervals is related to the graphics of the resulting map. Thus, a higher number of intervals would result in subtle changes in gradient, which, in turn, would make the exercise of delineating contours next to impossible. In this respect, the five-interval map produces a far clearer image.</p><p><br></p><p class=\"ql-align-center\">7</p>"
            }
          ]
        },
        {
          "id": 7,
          "name": "sharing"
        },
        {
          "id": 8,
          "name": "messaging"
        }
      ]
    },
    {
      "id": 2,
      "name": "Testing",
      "stages": [
        {
          "id": 1,
          "name": "questions",
          "title": "",
          "abstract": "",
          "keywords": [],
          "questions": []
        },
        {
          "id": 2,
          "name": "dataset"
        },
        {
          "id": 3,
          "name": "aquisition"
        },
        {
          "id": 4,
          "name": "processing"
        },
        {
          "id": 5,
          "name": "visualization"
        },
        {
          "id": 6,
          "name": "writing",
          "paper": []
        },
        {
          "id": 7,
          "name": "sharing"
        },
        {
          "id": 8,
          "name": "messaging"
        }
      ]
    },
    {
      "id": 3,
      "name": "Exploratory",
      "stages": [
        {
          "id": 1,
          "name": "questions",
          "title": "",
          "abstract": "",
          "keywords": [],
          "questions": []
        },
        {
          "id": 2,
          "name": "dataset"
        },
        {
          "id": 3,
          "name": "aquisition"
        },
        {
          "id": 4,
          "name": "processing"
        },
        {
          "id": 5,
          "name": "visualization"
        },
        {
          "id": 6,
          "name": "writing",
          "paper": []
        },
        {
          "id": 7,
          "name": "sharing"
        },
        {
          "id": 8,
          "name": "messaging"
        }
      ]
    }
  ]
}
